---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.Grid1Angle
source: html/b0a8ad8c-1729-b3d2-389d-dfca73e0a66b.htm
---
# Autodesk.Revit.DB.CurtainGrid.Grid1Angle Property

The angle for the U grid line pattern of the curtain grid.

## Syntax (C#)
```csharp
public double Grid1Angle { get; set; }
```